Terraform plan in __terraform__
<details>
  <summary>Plan: 17 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.github_repos will be created
  + resource "local_file" "github_repos" {
      + content              = <<-EOT
            _This file is generated by [Terraform](../terraform/github.md.tmpl)._
            
            # GitHub Repos
            
            | repo | status | Tech Portfolio manages all content? |
            | --- | --- | --- |
            | [18F/.github](https://github.com/18F/.github) | active | N |
            | [18F/aws-admin](https://github.com/18F/aws-admin) | active | Y |
            | [18F/aws-admin-cleanup](https://github.com/18F/aws-admin-cleanup) | active | Y |
            | [18F/before-you-ship](https://github.com/18F/before-you-ship) | archived | Y |
            | [18F/billing-tools](https://github.com/18F/billing-tools) | archived | Y |
            | [18F/bug-bounty](https://github.com/18F/bug-bounty) | active | Y |
            | [18F/certificate-service](https://github.com/18F/certificate-service) | archived | Y |
            | [18F/chandika](https://github.com/18F/chandika) | archived | Y |
            | [18F/charlie](https://github.com/18F/charlie) | active | Y |
            | [18F/chat](https://github.com/18F/chat) | active | Y |
            | [18F/deploy-ttslicenses](https://github.com/18F/deploy-ttslicenses) | archived | Y |
            | [18F/dns](https://github.com/18F/dns) | active | N |
            | [18F/ghad](https://github.com/18F/ghad) | active | Y |
            | [18F/glossary](https://github.com/18F/glossary) | active | Y |
            | [18F/handbook](https://github.com/18F/handbook) | active | N |
            | [18F/join.tts.gsa.gov](https://github.com/18F/join.tts.gsa.gov) | active | N |
            | [18F/laptop](https://github.com/18F/laptop) | archived | Y |
            | [18F/newrelic-terraform](https://github.com/18F/newrelic-terraform) | active | Y |
            | [18F/pages-redirects](https://github.com/18F/pages-redirects) | active | Y |
            | [18F/private-eye](https://github.com/18F/private-eye) | active | Y |
            | [18F/raktabija](https://github.com/18F/raktabija) | archived | Y |
            | [18F/slack-export-handling](https://github.com/18F/slack-export-handling) | archived | Y |
            | [18F/tts-common-controls](https://github.com/18F/tts-common-controls) | active | Y |
            | [18F/tts-tech-portfolio](https://github.com/18F/tts-tech-portfolio) | active | Y |
            | [18F/tts-tech-portfolio-private](https://github.com/18F/tts-tech-portfolio-private) | active | Y |
            | [18F/uswds-jekyll](https://github.com/18F/uswds-jekyll) | active | Y |
            | [18F/vulnerability-disclosure-policy](https://github.com/18F/vulnerability-disclosure-policy) | active | Y |
            
            For repositories where the Tech Portfolio _doesn't_ manage all content, we are the "technical owners", meaning we keep them running, fix any security vulnerabilities, etc. In the Handbook, we are responsible for pages related to things we own, like those under [software and tools](https://handbook.tts.gsa.gov/#software-and-tools).
            
            ## Adding a repository
            
            When a repository is considered "managed" by the Tech Portfolio, it should be included in the following places:
            
            - [The list in Terraform](../terraform/main.tf)
            - Linked repositories for project boards
              - [Team board](https://github.com/orgs/18F/projects/11/settings/linked_repositories)
              - [Pull requests](https://github.com/orgs/18F/projects/19/settings/linked_repositories)
        EOT
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "./../how_we_work/github.md"
      + id                   = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["g: accepted"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "662e9b"
      + description = "Issue has been fully groomed."
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "g: accepted"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["g: final"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "662e9b"
      + description = "Issue ready for review."
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "g: final"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["g: initial"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "662e9b"
      + description = "Issue template needs to be filled out, and/or initiative/timing labels need to be added."
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "g: initial"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["i: SaaS"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6ecbdb"
      + description = "Relating to third-party software: acquisition, security compliance, etc."
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "i: SaaS"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["i: custom software"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6ecbdb"
      + description = "Relating to systems built in TTS and their need for tools, guidance, security authorization, etc."
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "i: custom software"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["i: customer support"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6ecbdb"
      + description = "Relating to supporting TTS staff and partners: troubleshooting, documentation, etc."
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "i: customer support"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["i: infrastructure"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6ecbdb"
      + description = "Relating to technology underneath/supporting custom software across TTS"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "i: infrastructure"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["i: internal team"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6ecbdb"
      + description = "Relating to process or training within the Tech Portfolio, or communication about the team outwards"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "i: internal team"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["i: misc"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "6ecbdb"
      + description = "Issues that don't fit in another Initiative"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "i: misc"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["m: due date"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "ea3546"
      + description = "Has a hard or soft deadline"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "m: due date"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["t: days"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "f86624"
      + description = "Should be complete-able in a matter of days or less (wall clock time)"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "t: days"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["t: expedite"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "f86624"
      + description = "Needed to be pulled into a sprint after Planning was complete"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "t: expedite"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["t: months"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "f86624"
      + description = "Should be complete-able in a matter of months (wall clock time) — should be split up"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "t: months"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_issue_label.labels["t: weeks"] will be created
  + resource "github_issue_label" "labels" {
      + color       = "f86624"
      + description = "Should be complete-able in a matter of weeks (wall clock time) — see what can be split out"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "t: weeks"
      + repository  = "glossary"
      + url         = (known after apply)
    }

  # module.repo["glossary"].github_repository_file.issue_templates["general.md"] will be created
  + resource "github_repository_file" "issue_templates" {
      + branch              = "master"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = <<-EOT
            updated from canonical source
            
            https://github.com/18F/tts-tech-portfolio/blob/main/.github/ISSUE_TEMPLATE/general.md
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
            <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
            
            - [ ]
        EOT
      + file                = ".github/ISSUE_TEMPLATE/general.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "glossary"
      + sha                 = (known after apply)
    }

  # module.repo["glossary"].github_team_repository.admin will be created
  + resource "github_team_repository" "admin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "glossary"
      + team_id    = "*******"
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ active_repos = [
        # (7 unchanged elements hidden)
        "ghad",
      + "glossary",
        "handbook",
        # (9 unchanged elements hidden)
    ]
```
</details>

Plan generated in [plan #55](https://github.com/18F/tts-tech-portfolio/actions/runs/1027407038)